teory = {
             1: 'Фи́шинг — вид интернет-мошенничества, целью которого является получение доступа к конфиденциальным данным пользователей — логинам и паролям. Это достигается путём проведения массовых рассылок электронных писем от имени популярных брендов, а также личных сообщений внутри различных сервисов, например, от имени банков или внутри социальных сетей. В письме часто содержится прямая ссылка на сайт, внешне неотличимый от настоящего, либо на сайт с редиректом.',
             2: 'Двухфакторная аутентификация — это такой метод идентификации пользователя для входа в сервис, при котором нужно двумя разными способами подтвердить, что именно он — хозяин аккаунта.',
             3: 'Брутфорс (от англ. brute force — грубая сила) — метод угадывания пароля (или ключа, используемого для шифрования), предполагающий систематический перебор всех возможных комбинаций символов до тех пор, пока не будет найдена правильная комбинация.',
             4: 'Правила создания паролей:\n1. Не использовать одну и ту же связку на разных сайтах.\n2. Стараться не использовать одинаковые комбинации на разных сайтах.\n3.	Самые сложные и стойкие комбинации должны использоваться для самых важных сайтов – платежных систем, почтовых аккаунтов, с помощью которых можно сбросить пароли к платежным системам и т.д.',
             5: 'Как взламывают пароли\n\nДля брутфорса существуют программы, в которые загружается список популярных слов и комбинаций (словарь). Такой список можно найти в открытом доступе. Программа подставляет комбинации по очереди, в автоматическом режиме, пока не найдет рабочую последовательность.',

}

answerss = { 1: ['Подбор пароля', 'Взлом аккаунта с помощью ответа на контрольный вопрос', 'Кража учётных данных с помощью фальшивых сайтов, Маскирующихся под настоящие'],
            
            2: ['Связка логин+пароль', 'Логин+пароль+контрольный вопрос', 'Пароль+одноразовый код'],
            
            3: ['Взлом аккаунта с помощью ответа на контрольный вопрос', 'Подбор пароля', 'Кража учётных данных с помощью фальшивых сайтов, маскирующихся под настоящие'],

            4: ['qwertyasdf567 (пароль, в котором больше восьми символов)', 'Pripev04k@ (пароль, в котором есть большие и маленькие буквы, цифры и специальные символы)', ' 23051995 (дата рождения)'],
            
            5: ['Сотруднику службы безопасности банка или платёжного сервиса', 'Никому и ни при каких обстоятельствах', 'Близкому человеку'],
            

            }

ques = {
             1: 'Что такое фишинг?',
             2: 'Что такое двухфакторная аутентификация?',
             3: 'Что такое брутфорс?',
             4: 'Как известно, злоумышленникам не составляет труда подобрать простой пароль от почты. Именно поэтому, Яндекс.Почта рекомендует создавать сложные пароли. Какой из этих паролей вы не считаете сложным?',
             5: 'Кому можно сообщать свой платёжный пароль или код подтверждения по телефону?',
}
